In [37]:
import requests
from sodapy import Socrata
import pandas as pd
from sqlalchemy import create_engine
from config import password as pwr

must run: pip install sodapy

In [2]:
#originally did an API Pull before finding a better way
#url="https://data.cityofnewyork.us/resource/3y5p-x48f.json?schoolyear=20152016"
#school_results=requests.get(cases)
#school_results.json()
#school_db=pd.DataFrame(school_results)

In [9]:
#set up Socrata client
client = Socrata("data.cityofnewyork.us", None)

#get results
results = client.get("3y5p-x48f", limit=843113)

# Convert to pandas DataFrame
results_df = pd.DataFrame.from_records(results)

#show reults
results_df

WARNING:root:Requests made without an app_token will be subject to strict throttling limits.

        school        date schoolyear enrolled present absent released
0       01M015  01/04/2016   20152016      168     157     11        0
1       01M015  01/05/2016   20152016      168     153     15        0
2       01M015  01/06/2016   20152016      168     163      5        0
3       01M015  01/07/2016   20152016      168     154     14        0
4       01M015  01/08/2016   20152016      168     158     10        0
...        ...         ...        ...      ...     ...    ...      ...
843108  79X695  11/16/2017   20172018      223     182     41        0
843109  79X695  11/17/2017   20172018      220     177     43        0
843110  79X695  11/20/2017   20172018      216     181     32        3
843111  79X695  11/21/2017   20172018      217     188     29        0
843112  79X695  11/22/2017   20172018      215     187     28        0

[843113 rows x 7 columns]

In [10]:
#check the column types
results_df.dtypes

school        object
date          object
schoolyear    object
enrolled      object
present       object
absent        object
released      object
dtype: object

In [11]:
#delete columns
school_df=results_df[['school','date','schoolyear','enrolled','present','absent']]
school_df

        school        date schoolyear enrolled present absent
0       01M015  01/04/2016   20152016      168     157     11
1       01M015  01/05/2016   20152016      168     153     15
2       01M015  01/06/2016   20152016      168     163      5
3       01M015  01/07/2016   20152016      168     154     14
4       01M015  01/08/2016   20152016      168     158     10
...        ...         ...        ...      ...     ...    ...
843108  79X695  11/16/2017   20172018      223     182     41
843109  79X695  11/17/2017   20172018      220     177     43
843110  79X695  11/20/2017   20172018      216     181     32
843111  79X695  11/21/2017   20172018      217     188     29
843112  79X695  11/22/2017   20172018      215     187     28

[843113 rows x 6 columns]

In [13]:
#convert date to datetime
school_df['date']=pd.to_datetime(school_df['date'])

#convert to integers
school_df['enrolled']=school_df['enrolled'].astype(int)
school_df['present']=school_df['present'].astype(int)
school_df['absent']=school_df['absent'].astype(int)

#rename school to school_id which is the agreed column name that will join the group db together 
school_df.rename(columns={'school':'school_id'},inplace=True)

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [14]:
#verify
school_df.head()

  school_id       date schoolyear  enrolled  present  absent
0    01M015 2016-01-04   20152016       168      157      11
1    01M015 2016-01-05   20152016       168      153      15
2    01M015 2016-01-06   20152016       168      163       5
3    01M015 2016-01-07   20152016       168      154      14
4    01M015 2016-01-08   20152016       168      158      10

In [22]:
#organized by school_id and school year
school_attendance_df=school_df.groupby(['school_id','schoolyear']).mean()
school_attendance_df.head()

                        enrolled     present     absent
school_id schoolyear
01M015    20152016    167.797753  156.005618  11.634831
          20162017    173.954545  162.539773  11.329545
          20172018    187.067416  175.202247  11.674157
01M019    20152016    270.466292  246.297753  23.926966
          20162017    269.346591  243.738636  25.477273

In [ ]:
#create engine
engine = create_engine(f'postgresql://postgres:{pwr}@localhost:5432/project_2')
conn = engine.connect()

In [69]:
#here I'll want to break it down by year and add to one column
test_df=school_attendance_df.rename(columns={'enrolled':"enrolled_2015_2016",'present':'present_2015_2016','absent':'absent_2015_2016'})
df=test_df[test_df.index.isin(['20152016'], level=1)]
df.index=df.index.droplevel(1)

1634
1634

In [91]:
#here I'll connect
pd.read_sql('select * from school_attendance',engine)

Empty DataFrame
Columns: [school_id, enrolled_2015_2016, present_2015_2016, absent_2015_2016, enrolled_2016_2017, present_2016_2017, absent_2016_2017, enrolled_2017_2018, present_2017_2018, absent_2017_2018, enrolled_overall, present_overall, absent_overall]
Index: []

In [82]:
df.to_sql(name='school_attendance_2015_16', con=conn, if_exists='append', index=True)